Revit 2024 API
Wire.NumberOfVertices Property
 The number of vertices of the wire, including the start and end point.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public int NumberOfVertices { get; }
Visual Basic
Public ReadOnly Property NumberOfVertices As Integer
	Get
Visual C++
public:
property int NumberOfVertices {
	int get ();
}
See Also
Wire Class
Autodesk.Revit.DB.Electrical Namespace